       01 WS-INPUT-RECORD.
           05 WS-DATE-NUM              PIC 9(08).
           05 FILLER                   PIC X(01).
           05 WS-DATE-ALPHA            PIC X(10).
           05 FILLER                   PIC X(01).
           05 WS-ACCT-ALPHA            PIC X(08).
           05 FILLER                   PIC X(01).
           05 WS-AMOUNT-NUMERIC        PIC 9(10).
           05 FILLER                   PIC X(01).
           05 WS-AMOUNT-FRACTION       PIC 9(8)V9(2).
           05 FILLER                   PIC X(01).
           05 WS-NAME-ALPHABET         PIC A(10).
           05 FILLER                   PIC X(01).
           05 WS-AMOUNT-FRACTION2      PIC 9(8).9(2).
           05 FILLER                   PIC X(07).
