      ****************************************************************************
      *                                                                          *
      * Copyright 2018 ABSA Group Limited                                        *
      *                                                                          *
      * Licensed under the Apache License, Version 2.0 (the "License");          *
      * you may not use this file except in compliance with the License.         *
      * You may obtain a copy of the License at                                  *
      *                                                                          *
      *     http://www.apache.org/licenses/LICENSE-2.0                           *
      *                                                                          *
      * Unless required by applicable law or agreed to in writing, software      *
      * distributed under the License is distributed on an "AS IS" BASIS,        *
      * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. *
      * See the License for the specific language governing permissions and      *
      * limitations under the License.                                           *
      *                                                                          *
      ****************************************************************************

      ****** Names, Ids and values in this example are completely fictional and
      ****** were generated randomly. Any resemblance to actual persons or companies
      ****** or actual transactions is purely coincidental.

        01  TRANSDATA.
            05  CURRENCY          PIC X(3).
            05  SIGNATURE         PIC X(8).
            05  COMPANY-NAME-NP      PIC X(15).
            05  COMPIANY-ID       PIC X(10).
            05  WEALTH-QFY        PIC 9(1).
            05  AMOUNT            PIC S9(09)V99  BINARY.
            
